Repository: gnachman/iTerm2
Catalog: sources/ShellIntegrationInstaller/mul.lproj/iTermShellIntegrationWindowController.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# 3ik-Ec-g95.title
source: Downloads the latest version. Runs curl | bash
de: Lädt die neueste Version herunter. Führt curl | bash aus
ja: 最新バージョンをダウンロードします。curl | bashを実行します
pt_br: Baixa a versão mais recente. Executa curl | bash
ru: Загружает последнюю версию. Выполняет curl | bash
zh_hans: 下载最新版本。运行 curl | bash

# A3D-QU-2Cx.title
source: Continue
de: Fortfahren
ja: 続ける
pt_br: Continuar
ru: Продолжить
zh_hans: 继续

# BbS-EU-hMu.title
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# bFR-qd-VRH.title
source: 1. Discover which shell you use. 2. Add script files under your home directory. 3. Install utility scripts. 4. Modify your shell’s startup scripts.
de: 1. Ermitteln, welche Shell Sie verwenden. 2. Skriptdateien in Ihrem Home-Verzeichnis hinzufügen. 3. Hilfsskripte installieren. 4. Die Startskripte Ihrer Shell ändern.
ja: 1. 使用しているシェルを判別します。 2. ホームディレクトリ配下にスクリプトファイルを追加します。 3. ユーティリティスクリプトをインストールします。 4. シェルの起動スクリプトを変更します。
pt_br: 1. Descubra qual shell você usa. 2. Adicione arquivos de script na sua pasta de início. 3. Instale scripts utilitários. 4. Modifique os scripts de inicialização do seu shell.
ru: 1. Определяет, какой shell вы используете. 2. Добавляет файлы скриптов в вашем домашнем каталоге. 3. Устанавливает служебные скрипты. 4. Изменяет стартовые скрипты вашего shell.
zh_hans: 1. 确定你使用的 Shell。 2. 在主目录下添加脚本文件。 3. 安装实用工具脚本。 4. 修改你的 Shell 启动脚本。

# cmu-UF-19Z.title
source: Go Back
de: Zurück
ja: 戻る
pt_br: Voltar
ru: Назад
zh_hans: 返回

# cyF-wg-XYY.title
source: Utilities include scripts to download files, display images inline, and more.
de: Zu den Dienstprogrammen gehören Skripte zum Herunterladen von Dateien, zur Inline-Anzeige von Bildern und mehr.
ja: ユーティリティには、ファイルのダウンロード、画像のインライン表示などを行うスクリプトが含まれます。
pt_br: Os utilitários incluem scripts para baixar arquivos, exibir imagens em linha e muito mais.
ru: Утилиты включают скрипты для загрузки файлов, встроенного отображения изображений и не только.
zh_hans: 实用工具包括用于下载文件、内联显示图像等的脚本。

# dEn-49-J38.title
source: Go Back
de: Zurück
ja: 戻る
pt_br: Voltar
ru: Назад
zh_hans: 返回

# E0t-ip-Qv2.title
source: Continue
de: Fortfahren
ja: 続ける
pt_br: Continuar
ru: Продолжить
zh_hans: 继续

# Ghw-SZ-fwQ.title
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# GW7-My-Ydm.title
source: Skip
de: Überspringen
ja: スキップ
pt_br: Pular
ru: Пропустить
zh_hans: 跳过

# H9m-Oh-rVp.title
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# K0a-WG-CVu.title
source: Preview Command
de: Befehlsvorschau
ja: コマンドをプレビュー
pt_br: Pré-visualizar comando
ru: Просмотреть команду
zh_hans: 预览命令

# naS-Ve-VEB.title
source: Internet-Free Install
de: Installation ohne Internet
ja: インターネット不要のインストール
pt_br: Instalação sem internet
ru: Установка без интернета
zh_hans: 离线安装

# ncg-Is-RuU.title
source: Download and Run Installer
de: Installationsprogramm herunterladen und ausführen
ja: インストーラーをダウンロードして実行
pt_br: Baixar e executar o instalador
ru: Загрузить и запустить установщик
zh_hans: 下载并运行安装程序

# ntQ-Ku-Hh9.title
source: Also install iTerm2 Utilities
de: iTerm2-Dienstprogramme ebenfalls installieren
ja: iTerm2ユーティリティもインストールする
pt_br: Também instalar os utilitários do iTerm2
ru: Также установить утилиты iTerm2
zh_hans: 同时安装 iTerm2 工具

# oFz-OK-xmV.title
source: Guided manual installation. No download required.
de: Geführte manuelle Installation. Kein Download erforderlich.
ja: ガイド付き手動インストール。ダウンロードは不要です。
pt_br: Instalação manual guiada. Nenhum download necessário.
ru: Пошаговая ручная установка. Загрузка не требуется.
zh_hans: 引导式手动安装。无需下载。

# OOc-Is-r4d.title
source: Preview Command
de: Befehlsvorschau
ja: コマンドをプレビュー
pt_br: Pré-visualizar comando
ru: Просмотреть команду
zh_hans: 预览命令

# pUe-5J-qNa.title
source: Continue
de: Fortfahren
ja: 続ける
pt_br: Continuar
ru: Продолжить
zh_hans: 继续

# srv-Ew-0Pt.title
source: Preview Command
de: Befehlsvorschau
ja: コマンドをプレビュー
pt_br: Pré-visualizar comando
ru: Просмотреть команду
zh_hans: 预览命令

# u02-01-Bxc.title
source: Go Back
de: Zurück
ja: 戻る
pt_br: Voltar
ru: Назад
zh_hans: 返回

# UYA-J9-ck1.title
source: How would you like to install Shell Integration? In this process, your shell’s startup scripts will be modified. This installer will enter commands in the terminal window for you.
de: Wie möchten Sie die Shell-Integration installieren? Bei diesem Vorgang werden die Startskripte Ihrer Shell geändert. Dieses Installationsprogramm gibt die Befehle für Sie im Terminalfenster ein.
ja: シェル統合をどのようにインストールしますか？ この処理では、シェルの起動スクリプトが変更されます。このインストーラーがターミナルウィンドウにコマンドを入力します。
pt_br: Como você gostaria de instalar a Shell Integration? Nesse processo, os scripts de inicialização do seu shell serão modificados. Este instalador digitará os comandos na janela do terminal para você.
ru: Как вы хотите установить Shell-интеграцию? В ходе этого процесса будут изменены стартовые скрипты вашего shell. Этот установщик будет вводить команды в окне терминала за вас.
zh_hans: 你想如何安装 Shell 集成？ 在此过程中，你的 Shell 启动脚本将被修改。此安装程序会为你将命令输入到终端窗口中。

# vFx-5X-71f.title
source: Preview Command
de: Befehlsvorschau
ja: コマンドをプレビュー
pt_br: Pré-visualizar comando
ru: Просмотреть команду
zh_hans: 预览命令

# vT8-og-7pl.title
source: Installation complete!
de: Installation abgeschlossen!
ja: インストールが完了しました！
pt_br: Instalação concluída!
ru: Установка завершена!
zh_hans: 安装完成！

# w9k-Lv-5eU.title
source: This will run the following command: curl -L https://iterm2.com/shell_integration/install_shell_integration_and_utilities.sh | bash
de: Dies führt den folgenden Befehl aus: curl -L https://iterm2.com/shell_integration/install_shell_integration_and_utilities.sh | bash
ja: 以下のコマンドを実行します: curl -L https://iterm2.com/shell_integration/install_shell_integration_and_utilities.sh | bash
pt_br: Isto executará o seguinte comando: curl -L https://iterm2.com/shell_integration/install_shell_integration_and_utilities.sh | bash
ru: Будет выполнена следующая команда: curl -L https://iterm2.com/shell_integration/install_shell_integration_and_utilities.sh | bash
zh_hans: 这将运行以下命令： curl -L https://iterm2.com/shell_integration/install_shell_integration_and_utilities.sh | bash

# WeK-Fh-3OJ.title
source: Create a new tab to try it out. For best results, install shell integration on all hosts you ssh in to.
de: Erstellen Sie einen neuen Tab, um es auszuprobieren. Für beste Ergebnisse installieren Sie die Shell-Integration auf allen Hosts, mit denen Sie sich per SSH verbinden.
ja: 新しいタブを作成して試してみてください。 最良の結果を得るには、SSHで接続するすべてのホストにシェル統合をインストールしてください。
pt_br: Crie uma nova aba para testar. Para obter os melhores resultados, instale a Shell Integration em todos os hosts nos quais você entra via ssh.
ru: Создайте новую вкладку, чтобы опробовать это. Для лучшего результата установите shell-интеграцию на всех хостах, к которым вы подключаетесь по ssh.
zh_hans: 新建一个标签页试用。 为获得最佳效果，请在你要 ssh 登录的所有主机上安装 Shell 集成。

# wl0-hO-Vi5.title
source: Shell Integration consists of scripts that help your shell communicate with iTerm2 so it can track the commands you’re running, your current directory, and other state.
de: Die Shell-Integration besteht aus Skripten, die Ihrer Shell helfen, mit iTerm2 zu kommunizieren, damit die ausgeführten Befehle, Ihr aktuelles Verzeichnis und weitere Zustände nachverfolgt werden können.
ja: シェル統合は、シェルがiTerm2と通信できるようにするスクリプト群で構成されており、実行中のコマンドや現在のディレクトリなどの状態を追跡できるようにします。
pt_br: A Shell Integration consiste em scripts que ajudam o seu shell a se comunicar com o iTerm2 para que ele possa rastrear os comandos que você está executando, o seu diretório atual e outros estados.
ru: Shell-интеграция состоит из скриптов, которые помогают вашему shell взаимодействовать с iTerm2, чтобы отслеживать выполняемые вами команды, текущий каталог и другое состояние.
zh_hans: Shell 集成包含帮助你的 Shell 与 iTerm2 通信的脚本，使其能够跟踪你正在运行的命令、当前目录以及其他状态。

# ypn-Vl-A1e.title
source: Install Shell Integration
de: Shell-Integration installieren
ja: シェル統合をインストール
pt_br: Instalar Shell Integration
ru: Установить Shell-интеграцию
zh_hans: 安装 Shell 集成

# Zbw-qG-h4I.title
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# b2l-Qa-QNL.title
source: OK
ru: ОК
zh_hans: 好
